In [1]:
%load_ext sql
import sqlite3
import pandas as pd

In [2]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

# Data integrity test

# How many seats remain for an instructor's section for a particular course?

In [3]:
%%sql
SELECT DISTINCT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, INSTRUCTOR_NAME, COURSE_OFFERINGS.TERM
FROM COURSE_OFFERINGS
    JOIN INSTRUCTORS ON (COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID)
    JOIN COURSE_MEETINGS USING (COURSE_OFFERING_ID)
WHERE CAPACITY > 0
ORDER BY REMAINING DESC
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(32026, 'A', 100, 89, 'Jonathan G.  Grauer', 'Spring2015'),
 (37189, 'A', 100, 89, 'Jonathan G.  Grauer', 'Spring2016'),
 (34154, 1, 100, 86, 'Jonathan G.  Grauer', 'Spring2018'),
 (31167, 1, 100, 85, 'Jonathan G.  Grauer', 'Spring2017'),
 (39046, 0, 50, 49, 'Jonathan G.  Grauer', 'Spring2019'),
 (37145, 1, 50, 49, 'Jonathan G.  Grauer', 'Spring2019'),
 (72658, 1, 65, 45, 'Brendan S.  Mascarenhas', 'Fall2014'),
 (76879, 'C', 50, 42, 'Blake A.  Segal', 'Fall2015'),
 (78454, 3, 50, 41, 'Thomas R.  Schwans', 'Fall2016'),
 (74056, 1, 50, 39, 'Jonathan G.  Grauer', 'Fall2018')]

# What is the remaining capacity for each course offered?

In [4]:
%%sql
SELECT COURSE_OFFERINGS.CRN, SECTION, CAPACITY, REMAINING, COURSE_MEETINGS.TERM
FROM COURSE_OFFERINGS
    JOIN COURSE_MEETINGS USING (CRN)
WHERE COURSE_MEETINGS.TERM = 'Fall2018'
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018'),
 (74177, '01C', 0, -28, 'Fall2018')]

# How many courses are taught in each location?

In [21]:
%%sql
SELECT DISTINCT COURSE_MEETINGS.LOCATION_ID, ROOM_ID, COUNT(COURSE_OFFERING_ID)
FROM COURSE_MEETINGS
    LEFT JOIN LOCATIONS USING (LOCATION_ID)
GROUP BY COURSE_MEETINGS.LOCATION_ID, ROOM_ID
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'BCC 200', 26),
 (2, 'BD ', 11),
 (3, 'BH ', 381),
 (4, 'BH BY ARR', 15),
 (5, 'BLM 112', 13),
 (6, 'BLM LL105', 1339),
 (7, 'BNW 124', 2941),
 (8, 'BNW 127', 3966),
 (9, 'BNW 128', 731),
 (10, 'BNW 129B', 1301)]

# Tells us how many courses each professor has taught

In [17]:

%%sql
SELECT INSTRUCTOR_ID, INSTRUCTOR_NAME,COUNT(CRN),COUNT(COURSE_ID), COUNT(COURSE_OFFERINGS.CATALOG_ID)
FROM COURSE_OFFERINGS
    JOIN COURSES USING (CATALOG_ID)
    JOIN INSTRUCTORS ON COURSE_OFFERINGS.PRIMARY_INSTRUCTOR_ID = INSTRUCTORS.INSTRUCTOR_ID
GROUP BY INSTRUCTOR_ID
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne', 56, 56, 56),
 (2, 'Rebecca I.  Bloch', 52, 52, 52),
 (3, 'Paul   Caster', 56, 56, 56),
 (4, 'Jo Ann   Drusbosky', 70, 70, 70),
 (5, 'Arleen N.  Kardos', 40, 40, 40),
 (6, 'Scott M  Brenner', 54, 54, 54),
 (7, 'Kevin C.  Cassidy', 8, 8, 8),
 (8, 'Bruce   Bradford', 62, 62, 62),
 (9, 'Milo W.  Peck', 94, 94, 94),
 (10, 'Stephen E.  Yost', 42, 42, 42)]

# How many courses are in each program?

In [20]:
%%sql
SELECT PROGRAMS.PROGRAM_ID, PROGRAM_NAME, COUNT(TITLE)
FROM COURSES
    JOIN PROGRAMS USING (PROGRAM_ID)
GROUP BY PROGRAMS.PROGRAM_ID, PROGRAM_NAME
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Accounting', 68),
 (2, 'Applied Ethics', 64),
 (3, 'Art History', 72),
 (4, 'Asian Studies', 4),
 (5, 'Arabic', 16),
 (6, 'American Studies', 90),
 (7, 'Anthropology', 40),
 (8, 'Business', 20),
 (9, 'Bioengineering', 14),
 (10, 'Biology', 190)]